

// 설정 변경할 부분 정리

// ===============================
// General
// ===============================

// [Navigator Size]
// 프로젝트 네비게이터의 폰트 사이즈
// System -> Medium



// ===============================
// Accounts
// ===============================

// [Apple ID]

// [Github]



// ===============================
// Behaviors
// ===============================

// [Running > Starts > Show navigator Debug]
// OFF -> ON

// [Custom]
// Open Terminal 생성
// Run 을 통해 터미널 오픈하는 쉘스크립트 실행



// ===============================
// Themes
// ===============================

// [Source Editor > Theme]
// Default (Dark) -> Classic (Dark)



// ===============================
// Text Editing
// ===============================

// [Display > Code folding ribbon]
// OFF -> ON

// [Display > Page guide at column]
// OFF -> ON
// 80 -> 100

// [Display > Line Wrapping > Indent wrapped lines by]
// 4 -> 8



// ===============================
// Key Bindings
// ===============================

// [공통 단축키]
// 복사 : ⌘C
// 붙여넣기 : ⌘V
// 잘라내기 : ⌘X
// 실행취소 : ⌘Z
// 다시실행 : ⇧⌘Z
// 커서 앞으로 한글자 삭제 : ⌫
// 커서 뒤로 한글자 삭제 : Fn⌫
// 커서 앞으로 한단어 삭제 : ⌥⌫
// 커서 뒤로 한단어 삭제 : Fn⌥⌫
// 커서 앞으로 모두 삭제 :  ⌘⌫
// 커서 뒤로 모두 삭제 :  Fn⌘⌫
// 커서 줄시작으로 : ⌘←
// 커서 줄마지막으로 : ⌘→
// 커서 이전단어 시작으로 : ⌥←,
// 커서 이전단어 마지막으로 : ⌥→
// 커서 파일 시작으로 : ⌘↑
// 커서 파일 마지막으로 : ⌘↓
// 커서 페이지 위로 : Fn↑
// 커서 페이지 아래로 : Fn↓


// [유용한 단축키]
// 정의 가기 : ⌘[Symbol-Click]
// 문서 보기 : ⌥[Symbol-Click]
// 세로방향 선택 : ⌥[Editor-Drag]
// 변경 비교 : ⌘[Change-Click]
// 매칭 기호 찾기 : [Double-Click] (괄호를 더블 클릭하면 반대 괄호로 이동)
// Run : ⌘R
// 주석 : ⌘/
// 문서 : ⌥⌘/
// 파라미터 수직나열 : ⌘M
// 한줄복사 : ⌘D
// 검색 : ⌘F
// 바꾸기 : ⌘⌥F
// 전체 검색 : ⇧⌘F (이 단축키 대신 아래의 커스터마이징 단축키로 대체)
// 전체 바꾸기 : ⇧⌥⌘F
// 선택한 심볼 전체 검색 : ⇧⌃⌘F
// 프리뷰 : ⌥⌘⏎
// 프리뷰 갱신 : ⌥⌘P
// 다음 이슈 : ⌘'
// 이전 이슈 : ⇧⌘'
// 접기 : ⌥⌘←
// 펼치기 : ⌥⌘→
// 전체 접기 : ⇧⌃⌘←
// 전체 펼치기 : ⇧⌃⌘→
// 필터 바로가기 : ⌥⌘J
// 라인 바로가기 : ⌘L
// 코드 어시스턴트 : ⌃⌥⌘⏎
// 새탭 : ⌘T
// 에디터 폰트 확대 : ⌘+
// 에디터 폰트 축소 : ⌘-
// Settings 열기 : ⌘,


// !!!: 커스터마이징시 충돌나는 기존 단축키는 사용하지 않음
// [커스터마이징 단축키]
// 파일에서 전체 바꾸기 : ⌃⌘E -> ⌘E
// 한줄삭제 : nil -> ⇧⌘D
// 이름 리팩토링 : nil -> ⇧⌘R
// 빠른 찾기 : ⇧⌘O -> ⌃␣
// 선택한 문자열 전체 검색 : nil -> ⇧⌘F
// 자동완성 : ⌃␣ -> ⌘.
// 다음 변경 : ⌃\ -> ⌘\
// 이전 변경 : ⇧⌃\ -> ⇧⌘\
// 이전 페이지 : ⌃⌘← -> Fn←
// 다음 페이지 : ⌃⌘→ -> Fn→
// 콜 리스트 : nil -> ⌘S
// GIT 한줄 : nil -> ⌃⌘L
// GIT Blame : ⇧⌃⌘A -> ⌃⌘B
// 미니맵 : ⇧⌃⌘M -> ⌃⌘M
// 콜 찾기 : ⇧⌃⌘H -> ⌘H
// 조상 찾기 : nil -> ⌃⌘A (제대로 검색하기 위해서는 조상이 정의된 프레임워크 내부에서 진행)
// 자손 찾기 : nil -> ⌃⌘D (제대로 검색하기 위해서는 자손이 정의된 프레임워크 내부에서 진행)
// 브레이크포인트 토글 : ⌘Y -> ⌘B
// 정렬 : ⌃I -> ⌘I
// 한줄 올리기 : ⌥⌘[ -> ⌥⌘↑
// 한줄 내리기 : ⌥⌘] -> ⌥⌘↓
// 관련 파일 리스트 : ⌃1 -> ⇧⌘M
// 이전 히스토리 리스트 : ⌃2 -> ⇧⌘<
// 다음 히스토리 리스트 : ⌃3 -> ⇧⌘>
// 현재 파일 아웃라인 : ⌃6 -> ⇧⌘/ (참고로 처음부터 노출되지는 않지만 필터 검색 가능)
// 최대화 : ⌃⌘F -> ⌃⌘↑
// 네비게이터 열기/닫기 : ⌘0 -> ⌃⌘←
// 인스펙터 열기/닫기 : ⌥⌘0 -> ⌃⌘→
// 디버그영역 열기/닫기 : ⇧⌘D -> ⌃⌘↓
// 프로젝트 네비게이터 : ⌘1 -> ⌃,
// 소스컨트롤 네비게이터 : ⌘2 -> ⌃.
// 북마크 네비게이터 : ⌘3 -> ⌃/
// 검색 네비게이터 : ⌘4 -> ⌃⌘,
// 이슈 네비게이터 : ⌘5 -> ⌃⌘.
// 테스트 네비게이터 : ⌘6 -> ⌃⌘/
// 디버그 네비게이터 : ⌘7 -> ⌃⌥⌘,
// 브레이크포이트 네비게이터 : ⌘8 -> ⌃⌥⌘.
// 리포트 네비게이터 : ⌘9 -> ⌃⌥⌘/


